# От стандартния вход се въвеждат цели числа N и M, като N > 0.
# След това се въвеждат N цели числа, които могат да бъдат положителни, отрицателни или нула.
# Да се напише програма, която от въведените числа образува списък A, съдържащ всички елементи,
# които са по-малки от M. Ако списък A не е празен, да се намери и изведе сумата на елементите на
# четни позиции (позициите започват от 0), както и индексът на максималния елемент
# в списък A (при повече от един максимален елемент се извежда първият). Ако списък A е празен, да се изведе
# съобщението „No such data...“.
# След това от първоначалните числа да се образува списък B, съдържащ всички отрицателни числа
# , които са по-големи от −M. Ако списък B не е празен,
# да се изведе разликата между абсолютните стойности на най-големия и най-малкия елемент в него.
# Ако списък B е празен, да се изведе съобщението „No such data...“.

